numb_s_case_dict_list = {
    1 : '',
    2 : '',
    3 : '',
    4 : '',
    5 : '',
    6 : '',
    7 : '',
    8 : '',
    9 : '',
    0 : '', 
}

numb_dict_list = [
        
    {
        1 : 'бир',
        2 : 'эки',
        3 : 'үч',
        4 : 'төрт',
        5 : 'беш',
        6 : 'алты',
        7 : 'жети',
        8 : 'сегиз',
        9 : 'тогуз',
        0 : '',
    },

    {
        1 : 'он',
        2 : 'жыйырма',
        3 : 'отуз',
        4 : 'кырк',
        5 : 'элүү',
        6 : 'алтымыш',
        7 : 'жетимиш',
        8 : 'сексен',
        9 : 'токсон',
        0 : ''
    },

    {
        1 : 'жүз',
        2 : 'эки жүз',
        3 : 'үч жүз',
        4 : 'төрт жүз',
        5 : 'беш жүз',
        6 : 'алты жүз',
        7 : 'жети жүз',
        8 : 'сегиз жүз',
        9 : 'тогуз жүз',
        0 : ''
    },

    {
        1 : 'бир миң',
        2 : 'эки миң',
        3 : 'үч миң',
        4 : 'төрт миң',
        5 : 'беш миң',
        6 : 'алты миң',
        7 : 'жети миң',
        8 : 'сегиз миң',
        9 : 'тогуз миң',
        0 : 'миң'
    },

        {
        1 : 'он',
        2 : 'жыйырма',
        3 : 'отуз',
        4 : 'кырк',
        5 : 'элүү',
        6 : 'алтымыш',
        7 : 'жетимиш',
        8 : 'сексен',
        9 : 'токсон',
        0 : ''
    },

    {
        1 : 'жүз',
        2 : 'эки жүз',
        3 : 'үч жүз',
        4 : 'төрт жүз',
        5 : 'беш жүз',
        6 : 'алты жүз',
        7 : 'жети жүз',
        8 : 'сегиз жүз',
        9 : 'тогуз жүз',
        0 : ''
    },

    {
        1 : 'бир миллион',
        2 : 'эки миллион',
        3 : 'үч миллион',
        4 : 'төрт миллион',
        5 : 'беш миллион',
        6 : 'алты миллион',
        7 : 'жети миллион',
        8 : 'сегиз миллион',
        9 : 'тогуз миллион',
        0 : ''
    },

    {
        1 : 'бир миллиард',
        2 : 'эки миллиард',
        3 : 'үч миллиард',
        4 : 'төрт миллиард',
        5 : 'беш миллиард',
        6 : 'алты миллиард',
        7 : 'жети миллиард',
        8 : 'сегиз миллиард',
        9 : 'тогуз миллиард',
        0 : ''
    },

]

plur_dict_list = [

    {
        'аеёиоуыэюяөүАЕЁИОУЫЭЮЯӨҮ' : 'л',
        'шШщЩхХфФсСцЦчЧтТпПкК' : 'т',
        'гГңҢдДбБвВжЖзЗйЙлЛрРмМнН' : 'д',
    },

    {
        
        'ыЫаАяЯ' : 'ар',
        'иИеЕэЭ' : 'ер',
        'юЮёЁоОуУ' : 'ор',
        'өӨүҮ' : 'өр',

    },

]

case_dict_list = [
    
    {
        'ыЫаАяЯ' : 'ын',
        'иИеЕэЭ' : 'ин',
        'юЮёЁоОуУ' : 'ун',
        'өӨүҮ' : 'үн',

    },

    {
        
        'ыЫаАяЯ' : 'а',
        'иИеЕэЭ' : 'е',
        'юЮёЁоОуУ' : 'о',
        'өӨүҮ' : 'ө',

    },

    {
        
        'ыЫаАяЯ' : 'ы',
        'иИеЕэЭ' : 'и',
        'юЮёЁоОуУ' : 'у',
        'өӨүҮ' : 'ү',

    },

    {
        'юЮёЁоОуУ' : 'он',
        'өӨүҮ' : 'өн',

    },

    {
        
        'ыЫаАяЯ' : 'а',
        'иИеЕэЭ' : 'е',
        'юЮёЁоОуУ' : 'о',
        'өӨүҮ' : 'ө',

    },

]

vowl = 'аеёиоуыэюяөүАЕЁИОУЫЭЮЯӨҮ'
cons = 'шШщЩхХфФсСцЦчЧтТпПкКңҢдДбБвВжЖзЗйЙлЛрРмМнН'
z_cons = 'ңҢдДбБвВжЖзЗйЙлЛрРмМнН'
g_cons = 'шШщЩхХфФсСцЦчЧтТпПкК'
nums = '0123456789'